Infineon/AURIX_code_examples/code_examples/OneEye_DAS_QuickStart_1_KIT_TC375_LK/Libraries/Infra/Sfr/TC37x/IfxPort_bf.h
/** \brief Offset for Ifx_P_IN_Bits.P0 */
#define IFX_P_IN_P0_OFF (0u)

/** \brief Length for Ifx_P_IN_Bits.P1 */
#define IFX_P_IN_P1_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P1 */
#define IFX_P_IN_P1_MSK (0x1u)

/** \brief Offset for Ifx_P_IN_Bits.P1 */
#define IFX_P_IN_P1_OFF (1u)

/** \brief Length for Ifx_P_IN_Bits.P2 */
#define IFX_P_IN_P2_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P2 */
#define IFX_P_IN_P2_MSK (0x1u)

/** \brief Offset for Ifx_P_IN_Bits.P2 */
#define IFX_P_IN_P2_OFF (2u)

/** \brief Length for Ifx_P_IN_Bits.P3 */
#define IFX_P_IN_P3_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P3 */
#define IFX_P_IN_P3_MSK (0x1u)

/** \brief Offset for Ifx_P_IN_Bits.P3 */
#define IFX_P_IN_P3_OFF (3u)

/** \brief Length for Ifx_P_IN_Bits.P4 */
#define IFX_P_IN_P4_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P4 */
#define IFX_P_IN_P4_MSK (0x1u)

/** \brief Offset for Ifx_P_IN_Bits.P4 */
#define IFX_P_IN_P4_OFF (4u)

/** \brief Length for Ifx_P_IN_Bits.P5 */
#define IFX_P_IN_P5_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P5 */
#define IFX_P_IN_P5_MSK (0x1u)

/** \brief Offset for Ifx_P_IN_Bits.P5 */
#define IFX_P_IN_P5_OFF (5u)

/** \brief Length for Ifx_P_IN_Bits.P6 */
#define IFX_P_IN_P6_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P6 */
#define IFX_P_IN_P6_MSK (0x1u)

/** \brief Offset for Ifx_P_IN_Bits.P6 */
#define IFX_P_IN_P6_OFF (6u)

/** \brief Length for Ifx_P_IN_Bits.P7 */
#define IFX_P_IN_P7_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P7 */
#define IFX_P_IN_P7_MSK (0x1u)

/** \brief Offset for Ifx_P_IN_Bits.P7 */
#define IFX_P_IN_P7_OFF (7u)

/** \brief Length for Ifx_P_IN_Bits.P8 */
#define IFX_P_IN_P8_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P8 */
#define IFX_P_IN_P8_MSK (0x1u)

/** \brief Offset for Ifx_P_IN_Bits.P8 */
#define IFX_P_IN_P8_OFF (8u)

/** \brief Length for Ifx_P_IN_Bits.P9 */
#define IFX_P_IN_P9_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P9 */
#define IFX_P_IN_P9_MSK (0x1u)

/** \brief Offset for Ifx_P_IN_Bits.P9 */
#define IFX_P_IN_P9_OFF (9u)

/** \brief Length for Ifx_P_IN_Bits.P10 */
#define IFX_P_IN_P10_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P10 */
#define IFX_P_IN_P10_MSK (0x1u)

/** \brief Offset for Ifx_P_IN_Bits.P10 */
#define IFX_P_IN_P10_OFF (10u)

/** \brief Length for Ifx_P_IN_Bits.P11 */
#define IFX_P_IN_P11_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P11 */
#define IFX_P_IN_P11_MSK (0x1u)

/** \brief Offset for Ifx_P_IN_Bits.P11 */
#define IFX_P_IN_P11_OFF (11u)

/** \brief Length for Ifx_P_IN_Bits.P12 */
#define IFX_P_IN_P12_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P12 */
#define IFX_P_IN_P12_MSK (0x1u)

/** \brief Offset for Ifx_P_IN_Bits.P12 */
#define IFX_P_IN_P12_OFF (12u)

/** \brief Length for Ifx_P_IN_Bits.P13 */
#define IFX_P_IN_P13_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P13 */
#define IFX_P_IN_P13_MSK (0x1u)

/** \brief Offset for Ifx_P_IN_Bits.P13 */
#define IFX_P_IN_P13_OFF (13u)

/** \brief Length for Ifx_P_IN_Bits.P14 */
#define IFX_P_IN_P14_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P14 */
#define IFX_P_IN_P14_MSK (0x1u)

/** \brief Offset for Ifx_P_IN_Bits.P14 */
#define IFX_P_IN_P14_OFF (14u)

/** \brief Length for Ifx_P_IN_Bits.P15 */
#define IFX_P_IN_P15_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P15 */
#define IFX_P_IN_P15_MSK (0x1u)

/** \brief Offset for Ifx_P_IN_Bits.P15 */
#define IFX_P_IN_P15_OFF (15u)

/** \brief Length for Ifx_P_PDR0_Bits.PD0 */
#define IFX_P_PDR0_PD0_LEN (2u)

/** \brief Mask for Ifx_P_PDR0_Bits.PD0 */
#define IFX_P_PDR0_PD0_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR0_Bits.PD0 */
#define IFX_P_PDR0_PD0_OFF (0u)

/** \brief Length for Ifx_P_PDR0_Bits.PL0 */
#define IFX_P_PDR0_PL0_LEN (2u)

/** \brief Mask for Ifx_P_PDR0_Bits.PL0 */
#define IFX_P_PDR0_PL0_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR0_Bits.PL0 */
#define IFX_P_PDR0_PL0_OFF (2u)

/** \brief Length for Ifx_P_PDR0_Bits.PD1 */
#define IFX_P_PDR0_PD1_LEN (2u)

/** \brief Mask for Ifx_P_PDR0_Bits.PD1 */
#define IFX_P_PDR0_PD1_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR0_Bits.PD1 */
#define IFX_P_PDR0_PD1_OFF (4u)

/** \brief Length for Ifx_P_PDR0_Bits.PL1 */
#define IFX_P_PDR0_PL1_LEN (2u)

/** \brief Mask for Ifx_P_PDR0_Bits.PL1 */
#define IFX_P_PDR0_PL1_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR0_Bits.PL1 */
#define IFX_P_PDR0_PL1_OFF (6u)

/** \brief Length for Ifx_P_PDR0_Bits.PD2 */
#define IFX_P_PDR0_PD2_LEN (2u)

/** \brief Mask for Ifx_P_PDR0_Bits.PD2 */
#define IFX_P_PDR0_PD2_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR0_Bits.PD2 */
#define IFX_P_PDR0_PD2_OFF (8u)

/** \brief Length for Ifx_P_PDR0_Bits.PL2 */
#define IFX_P_PDR0_PL2_LEN (2u)

/** \brief Mask for Ifx_P_PDR0_Bits.PL2 */
#define IFX_P_PDR0_PL2_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR0_Bits.PL2 */
#define IFX_P_PDR0_PL2_OFF (10u)

/** \brief Length for Ifx_P_PDR0_Bits.PD3 */
#define IFX_P_PDR0_PD3_LEN (2u)

/** \brief Mask for Ifx_P_PDR0_Bits.PD3 */
#define IFX_P_PDR0_PD3_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR0_Bits.PD3 */
#define IFX_P_PDR0_PD3_OFF (12u)

/** \brief Length for Ifx_P_PDR0_Bits.PL3 */
#define IFX_P_PDR0_PL3_LEN (2u)

/** \brief Mask for Ifx_P_PDR0_Bits.PL3 */
#define IFX_P_PDR0_PL3_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR0_Bits.PL3 */
#define IFX_P_PDR0_PL3_OFF (14u)

/** \brief Length for Ifx_P_PDR0_Bits.PD4 */
#define IFX_P_PDR0_PD4_LEN (2u)

/** \brief Mask for Ifx_P_PDR0_Bits.PD4 */
#define IFX_P_PDR0_PD4_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR0_Bits.PD4 */
#define IFX_P_PDR0_PD4_OFF (16u)

/** \brief Length for Ifx_P_PDR0_Bits.PL4 */
#define IFX_P_PDR0_PL4_LEN (2u)

/** \brief Mask for Ifx_P_PDR0_Bits.PL4 */
#define IFX_P_PDR0_PL4_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR0_Bits.PL4 */
#define IFX_P_PDR0_PL4_OFF (18u)

/** \brief Length for Ifx_P_PDR0_Bits.PD5 */
#define IFX_P_PDR0_PD5_LEN (2u)

/** \brief Mask for Ifx_P_PDR0_Bits.PD5 */
#define IFX_P_PDR0_PD5_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR0_Bits.PD5 */
#define IFX_P_PDR0_PD5_OFF (20u)

/** \brief Length for Ifx_P_PDR0_Bits.PL5 */
#define IFX_P_PDR0_PL5_LEN (2u)

/** \brief Mask for Ifx_P_PDR0_Bits.PL5 */
#define IFX_P_PDR0_PL5_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR0_Bits.PL5 */
#define IFX_P_PDR0_PL5_OFF (22u)

/** \brief Length for Ifx_P_PDR0_Bits.PD6 */
#define IFX_P_PDR0_PD6_LEN (2u)

/** \brief Mask for Ifx_P_PDR0_Bits.PD6 */
#define IFX_P_PDR0_PD6_MSK (0x3u)

